Sambulov/COS/MCU/ARM/Gigadevice/GD32F103VG/Port/port_core.c
#include "hdl_portable.h"
#include "Macros.h"

typedef struct {
  hdl_nvic_irq_n_t irq_type;
  uint8_t priority_group;
  uint8_t priority;
  hdl_event_t event;
} hdl_nvic_interrupt_private_t;

_Static_assert(sizeof(hdl_nvic_interrupt_private_t) == sizeof(hdl_nvic_interrupt_t), "In hdl_core.h data structure size of hdl_nvic_interrupt_t doesn't match, check HDL_INTERRUPT_PRV_SIZE");

extern void *_estack;
extern void *_sidata, *_sdata, *_edata;
extern void *_sbss, *_ebss;

//void SystemInit();
void __libc_init_array();
void main();
hdl_nvic_t *__ic = NULL;

static void _call_isr(IRQn_Type irq, hdl_nvic_interrupt_t **isrs, uint32_t event) {
  if(isrs != NULL) {
    while (*isrs != NULL) {
      if((*isrs)->irq_type == irq) {
        hdl_nvic_interrupt_private_t *isr = (hdl_nvic_interrupt_private_t *)*isrs;
        if(!hdl_event_raise(&isr->event, __ic, event))
          NVIC_DisableIRQ(irq);
        return;
      }
      isrs++;
    }
  }
  //If you get stuck here, your code is missing some interrupt request. see interrupts in MIG file.
	asm("bkpt 255");
  for(;;) ;
}

void irq_n_handler();

void Reset_Handler();
void NMI_Handler()                      { _call_isr(HDL_NVIC_EXCEPTION_NonMaskableInt, __ic->interrupts, 0); }
void HardFault_Handler()                { _call_isr(HDL_NVIC_EXCEPTION_HardFault, __ic->interrupts, 0); }
void MemManage_Handler()                { _call_isr(HDL_NVIC_EXCEPTION_MemoryManagement, __ic->interrupts, 0); } /* MPU Fault Handler */
void BusFault_Handler()                 { _call_isr(HDL_NVIC_EXCEPTION_BusFault, __ic->interrupts, 0); }
void UsageFault_Handler()               { _call_isr(HDL_NVIC_EXCEPTION_UsageFault, __ic->interrupts, 0); }
void SVC_Handler();                     /* HDL_NVIC_EXCEPTION_SVCall */
void DebugMon_Handler()                 { _call_isr(HDL_NVIC_EXCEPTION_DebugMonitor, __ic->interrupts, 0); }
void PendSV_Handler()                   { _call_isr(HDL_NVIC_EXCEPTION_PendSV, __ic->interrupts, 0); }
void SysTick_Handler()                  { _call_isr(HDL_NVIC_EXCEPTION_SysTick, __ic->interrupts, 0); }

void wwdgt_handler()                    { _call_isr(HDL_NVIC_IRQ0_WWDGT, __ic->interrupts, 0); }
void lvd_handler()                      { _call_isr(HDL_NVIC_IRQ1_LVD, __ic->interrupts, 0); }
void TAMPER_IRQHandler()                { _call_isr(HDL_NVIC_IRQ2_TAMPER, __ic->interrupts, 0); }   
void rtc_handler()                      { _call_isr(HDL_NVIC_IRQ3_RTC, __ic->interrupts, 0); }
void fmc_handler()                      { _call_isr(HDL_NVIC_IRQ4_FMC, __ic->interrupts, 0); }
void rcu_handler()                      { _call_isr(HDL_NVIC_IRQ5_RCU_CTC, __ic->interrupts, 0); }
void EXTI0_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ6_EXTI0, __ic->interrupts, EXTI_0); EXTI_PD |= EXTI_0; }
void EXTI1_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ7_EXTI1, __ic->interrupts, EXTI_1); EXTI_PD |= EXTI_1; }
void EXTI2_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ8_EXTI2, __ic->interrupts, EXTI_2); EXTI_PD |= EXTI_2; }
void EXTI3_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ9_EXTI3, __ic->interrupts, EXTI_3); EXTI_PD |= EXTI_3; }
void EXTI4_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ10_EXTI4, __ic->interrupts, EXTI_4); EXTI_PD |= EXTI_4; }
void DMA0_Channel0_IRQHandler()         { _call_isr(HDL_NVIC_IRQ11_DMA0_Channel0, __ic->interrupts, 0); }
void DMA0_Channel1_IRQHandler()         { _call_isr(HDL_NVIC_IRQ12_DMA0_Channel1, __ic->interrupts, 0); }
void DMA0_Channel2_IRQHandler()         { _call_isr(HDL_NVIC_IRQ13_DMA0_Channel2, __ic->interrupts, 0); }
void DMA0_Channel3_IRQHandler()         { _call_isr(HDL_NVIC_IRQ14_DMA0_Channel3, __ic->interrupts, 0); }
void DMA0_Channel4_IRQHandler()         { _call_isr(HDL_NVIC_IRQ15_DMA0_Channel4, __ic->interrupts, 0); }
void DMA0_Channel5_IRQHandler()         { _call_isr(HDL_NVIC_IRQ16_DMA0_Channel5, __ic->interrupts, 0); } 
void DMA0_Channel6_IRQHandler()         { _call_isr(HDL_NVIC_IRQ17_DMA0_Channel6, __ic->interrupts, 0); }
void ADC0_1_IRQHandler()                { _call_isr(HDL_NVIC_IRQ18_ADC0_1, __ic->interrupts, 0); }

#ifdef GD32F10X_MD
void USBD_HP_CAN0_TX_IRQHandler         { _call_isr(HDL_NVIC_IRQ19_USBD_HP_CAN0_TX, __ic->interrupts, 0); } /* IRQ19 */
void USBD_LP_CAN0_RX0_IRQHandler()      { _call_isr(HDL_NVIC_IRQ20_USBD_LP_CAN0_RX0, __ic->interrupts, 0); } /* IRQ20 */
void CAN0_RX1_IRQHandler()              { _call_isr(HDL_NVIC_IRQ21_CAN0_RX1, __ic->interrupts, 0); } /* IRQ21 */
void CAN0_EWMC_IRQHandler()             { _call_isr(HDL_NVIC_IRQ22_CAN0_EWMC, __ic->interrupts, 0); } /* IRQ22 */
void EXTI5_9_IRQHandler()               { _call_isr(HDL_NVIC_IRQ23_EXTI5_9, __ic->interrupts, EXTI_PD & EXTI_LINES_5_9); EXTI_PD |= EXTI_LINES_5_9; } /* IRQ23 */
void TIMER0_BRK_IRQHandler()            { _call_isr(HDL_NVIC_IRQ24_TIMER0_BRK, __ic->interrupts, 0); } /* IRQ24 */
void TIMER0_UP_IRQHandler()             { _call_isr(HDL_NVIC_IRQ25_TIMER0_UP, __ic->interrupts, 0); } /* IRQ25 */
void TIMER0_TRG_CMT_IRQHandler()        { _call_isr(HDL_NVIC_IRQ26_TIMER0_TRG_CMT, __ic->interrupts, 0); } /* IRQ26 */
void timer0_channel_handler()           { _call_isr(HDL_NVIC_IRQ27_TIMER0_Channel, __ic->interrupts, 0); } /* IRQ27 */
void TIMER1_IRQHandler()                { _call_isr(HDL_NVIC_IRQ28_TIMER1, __ic->interrupts, 0); } /* IRQ28 */
void timer2_handler()                   { _call_isr(HDL_NVIC_IRQ29_TIMER2, __ic->interrupts, 0); } /* IRQ29 */
void TIMER3_IRQHandler()                { _call_isr(HDL_NVIC_IRQ30_TIMER3, __ic->interrupts, 0); } /* IRQ30 */
void i2c0_ev_handler()                  { _call_isr(HDL_NVIC_IRQ31_I2C0_EV, __ic->interrupts, 0); } /* IRQ31 */
void i2c0_er_handler()                  { _call_isr(HDL_NVIC_IRQ32_I2C0_ER, __ic->interrupts, 0); } /* IRQ32 */
void i2c1_ev_handler()                  { _call_isr(HDL_NVIC_IRQ33_I2C1_EV, __ic->interrupts, 0); } /* IRQ33 */
void i2c1_er_handler()                  { _call_isr(HDL_NVIC_IRQ34_I2C1_ER, __ic->interrupts, 0); } /* IRQ34 */
void spi0_handler()                     { _call_isr(HDL_NVIC_IRQ35_SPI0, __ic->interrupts, 0); } /* IRQ35 */
void spi1_handler()                     { _call_isr(HDL_NVIC_IRQ36_SPI1, __ic->interrupts, 0); } /* IRQ36 */
void usart0_handler()                   { _call_isr(HDL_NVIC_IRQ37_USART0, __ic->interrupts, 0); } /* IRQ37 */
void usart1_handler()                   { _call_isr(HDL_NVIC_IRQ38_USART1, __ic->interrupts, 0); } /* IRQ38 */
void USART2_IRQHandler()                { _call_isr(HDL_NVIC_IRQ39_USART2, __ic->interrupts, 0); } /* IRQ39 */
void EXTI10_15_IRQHandler()             { _call_isr(HDL_NVIC_IRQ40_EXTI10_15, __ic->interrupts, EXTI_PD & EXTI_LINES_10_15); EXTI_PD |= EXTI_LINES_10_15; } /* IRQ40 */
void RTC_Alarm_IRQHandler()             { _call_isr(HDL_NVIC_IRQ41_RTC_Alarm, __ic->interrupts, 0); } /* IRQ41 */
void USBD_WKUP_IRQHandler()             { _call_isr(HDL_NVIC_IRQ42_USBD_WKUP, __ic->interrupts, 0); } /* IRQ42 */
void EXMC_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ48_EXMC, __ic->interrupts, 0); } /* IRQ48 */
#endif /* GD32F10X_MD */
#ifdef GD32F10X_HD
void USBD_HP_CAN0_TX_IRQHandler()       { _call_isr(HDL_NVIC_IRQ19_USBD_HP_CAN0_TX, __ic->interrupts, 0); } /* IRQ19 */
void USBD_LP_CAN0_RX0_IRQHandler()      { _call_isr(HDL_NVIC_IRQ20_USBD_LP_CAN0_RX0, __ic->interrupts, 0); } /* IRQ20 */
void CAN0_RX1_IRQHandler()              { _call_isr(HDL_NVIC_IRQ21_CAN0_RX1, __ic->interrupts, 0); } /* IRQ21 */
void CAN0_EWMC_IRQHandler()             { _call_isr(HDL_NVIC_IRQ22_CAN0_EWMC, __ic->interrupts, 0); } /* IRQ22 */
void EXTI5_9_IRQHandler()               { _call_isr(HDL_NVIC_IRQ23_EXTI5_9, __ic->interrupts, EXTI_PD & EXTI_LINES_5_9); EXTI_PD |= EXTI_LINES_5_9; } /* IRQ23 */
void TIMER0_BRK_IRQHandler()            { _call_isr(HDL_NVIC_IRQ24_TIMER0_BRK, __ic->interrupts, 0); } /* IRQ24 */
void TIMER0_UP_IRQHandler()             { _call_isr(HDL_NVIC_IRQ25_TIMER0_UP, __ic->interrupts, 0); } /* IRQ25 */
void TIMER0_TRG_CMT_IRQHandler()        { _call_isr(HDL_NVIC_IRQ26_TIMER0_TRG_CMT, __ic->interrupts, 0); } /* IRQ26 */
void timer0_channel_handler()           { _call_isr(HDL_NVIC_IRQ27_TIMER0_Channel, __ic->interrupts, 0); } /* IRQ27 */
void TIMER1_IRQHandler()                { _call_isr(HDL_NVIC_IRQ28_TIMER1, __ic->interrupts, 0); } /* IRQ28 */
void timer2_handler()                   { _call_isr(HDL_NVIC_IRQ29_TIMER2, __ic->interrupts, 0); } /* IRQ29 */
void TIMER3_IRQHandler()                { _call_isr(HDL_NVIC_IRQ30_TIMER3, __ic->interrupts, 0); } /* IRQ30 */
void i2c0_ev_handler()                  { _call_isr(HDL_NVIC_IRQ31_I2C0_EV, __ic->interrupts, 0); } /* IRQ31 */
void i2c0_er_handler()                  { _call_isr(HDL_NVIC_IRQ32_I2C0_ER, __ic->interrupts, 0); } /* IRQ32 */
void i2c1_ev_handler()                  { _call_isr(HDL_NVIC_IRQ33_I2C1_EV, __ic->interrupts, 0); } /* IRQ33 */
void i2c1_er_handler()                  { _call_isr(HDL_NVIC_IRQ34_I2C1_ER, __ic->interrupts, 0); } /* IRQ34 */
void spi0_handler()                     { _call_isr(HDL_NVIC_IRQ35_SPI0, __ic->interrupts, 0); } /* IRQ35 */
void spi1_handler()                     { _call_isr(HDL_NVIC_IRQ36_SPI1, __ic->interrupts, 0); } /* IRQ36 */
void usart0_handler()                   { _call_isr(HDL_NVIC_IRQ37_USART0, __ic->interrupts, 0); } /* IRQ37 */
void usart1_handler()                   { _call_isr(HDL_NVIC_IRQ38_USART1, __ic->interrupts, 0); } /* IRQ38 */
void USART2_IRQHandler()                { _call_isr(HDL_NVIC_IRQ39_USART2, __ic->interrupts, 0); } /* IRQ39 */
void EXTI10_15_IRQHandler()             { _call_isr(HDL_NVIC_IRQ40_EXTI10_15, __ic->interrupts, EXTI_PD & EXTI_LINES_10_15); EXTI_PD |= EXTI_LINES_10_15; } /* IRQ40 */
void RTC_Alarm_IRQHandler()             { _call_isr(HDL_NVIC_IRQ41_RTC_Alarm, __ic->interrupts, 0); } /* IRQ41 */
void USBD_WKUP_IRQHandler()             { _call_isr(HDL_NVIC_IRQ42_USBD_WKUP, __ic->interrupts, 0); } /* IRQ42 */
void TIMER7_BRK_IRQHandler()            { _call_isr(HDL_NVIC_IRQ43_TIMER7_BRK, __ic->interrupts, 0); } /* IRQ43 */
void TIMER7_UP_IRQHandler()             { _call_isr(HDL_NVIC_IRQ44_TIMER7_UP, __ic->interrupts, 0); } /* IRQ44 */
void TIMER7_TRG_CMT_IRQHandler()        { _call_isr(HDL_NVIC_IRQ45_TIMER7_TRG_CMT, __ic->interrupts, 0); } /* IRQ45 */
void TIMER7_Channel_IRQHandler()        { _call_isr(HDL_NVIC_IRQ46_TIMER7_Channel, __ic->interrupts, 0); } /* IRQ46 */
void ADC2_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ47_ADC2, __ic->interrupts, 0); } /* IRQ47 */
void EXMC_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ48_EXMC, __ic->interrupts, 0); } /* IRQ48 */
void SDIO_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ49_SDIO, __ic->interrupts, 0); } /* IRQ49 */
void TIMER4_IRQHandler()                { _call_isr(HDL_NVIC_IRQ50_TIMER4, __ic->interrupts, 0); } /* IRQ50 */
void SPI2_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ51_SPI2, __ic->interrupts, 0); } /* IRQ51 */
void UART3_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ52_UART3, __ic->interrupts, 0); } /* IRQ52 */
void UART4_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ53_UART4, __ic->interrupts, 0); } /* IRQ53 */
void timer5_handler()                   { _call_isr(HDL_NVIC_IRQ54_TIMER5, __ic->interrupts, 0); } /* IRQ54 */
void TIMER6_IRQHandler()                { _call_isr(HDL_NVIC_IRQ55_TIMER6, __ic->interrupts, 0); } /* IRQ55 */
void DMA1_Channel0_IRQHandler()         { _call_isr(HDL_NVIC_IRQ56_DMA1_Channel0, __ic->interrupts, 0); } /* IRQ56 */
void DMA1_Channel1_IRQHandler()         { _call_isr(HDL_NVIC_IRQ57_DMA1_Channel1, __ic->interrupts, 0); } /* IRQ57 */
void DMA1_Channel2_IRQHandler()         { _call_isr(HDL_NVIC_IRQ58_DMA1_Channel2, __ic->interrupts, 0); } /* IRQ58 */
void DMA1_Channel3_4_IRQHandler()       { _call_isr(HDL_NVIC_IRQ59_DMA1_Channel3_Channel4, __ic->interrupts, 0); } /* IRQ59 */
#endif /* GD32F10X_HD */
#ifdef GD32F10X_XD
void USBD_HP_CAN0_TX_IRQHandler()       { _call_isr(HDL_NVIC_IRQ19_USBD_HP_CAN0_TX, __ic->interrupts, 0); } /* IRQ19 */
void USBD_LP_CAN0_RX0_IRQHandler()      { _call_isr(HDL_NVIC_IRQ20_USBD_LP_CAN0_RX0, __ic->interrupts, 0); } /* IRQ20 */
void CAN0_RX1_IRQHandler()              { _call_isr(HDL_NVIC_IRQ21_CAN0_RX1, __ic->interrupts, 0); } /* IRQ21 */
void CAN0_EWMC_IRQHandler()             { _call_isr(HDL_NVIC_IRQ22_CAN0_EWMC, __ic->interrupts, 0); }  /* IRQ22 */
void EXTI5_9_IRQHandler()               { _call_isr(HDL_NVIC_IRQ23_EXTI5_9, __ic->interrupts, EXTI_PD & EXTI_LINES_5_9); EXTI_PD |= EXTI_LINES_5_9; } /* IRQ23 */
void TIMER0_BRK_TIMER8_IRQHandler()     { _call_isr(HDL_NVIC_IRQ24_TIMER0_BRK_TIMER8, __ic->interrupts, 0); } /* IRQ24 */
void TIMER0_UP_TIMER9_IRQHandler()      { _call_isr(HDL_NVIC_IRQ25_TIMER0_UP_TIMER9, __ic->interrupts, 0);
                                          TIMER_INTF(TIMER0) &= ~TIMER_INTF_UPIF;
                                          TIMER_INTF(TIMER9) &= ~TIMER_INTF_UPIF;
                                        } /* IRQ25 */
void TIMER0_TRG_CMT_TIMER10_IRQHandler(){ _call_isr(HDL_NVIC_IRQ26_TIMER0_TRG_CMT_TIMER10, __ic->interrupts, 0); } /* IRQ26 */
void timer0_channel_handler()           { _call_isr(HDL_NVIC_IRQ27_TIMER0_Channel, __ic->interrupts, 0); } /* IRQ27 */
void TIMER1_IRQHandler()                { _call_isr(HDL_NVIC_IRQ28_TIMER1, __ic->interrupts, 0);
                                          TIMER_INTF(TIMER1) &= ~TIMER_INTF_UPIF;
                                        } /* IRQ28 */
void timer2_handler()                   { _call_isr(HDL_NVIC_IRQ29_TIMER2, __ic->interrupts, 0); } /* IRQ29 */
void TIMER3_IRQHandler()                { _call_isr(HDL_NVIC_IRQ30_TIMER3, __ic->interrupts, 0); } /* IRQ30 */
void i2c0_ev_handler()                  { _call_isr(HDL_NVIC_IRQ31_I2C0_EV, __ic->interrupts, 0); } /* IRQ31 */
void i2c0_er_handler()                  { _call_isr(HDL_NVIC_IRQ32_I2C0_ER, __ic->interrupts, 0); } /* IRQ32 */
void i2c1_ev_handler()                  { _call_isr(HDL_NVIC_IRQ33_I2C1_EV, __ic->interrupts, 0); } /* IRQ33 */
void i2c1_er_handler()                  { _call_isr(HDL_NVIC_IRQ34_I2C1_ER, __ic->interrupts, 0); } /* IRQ34 */
void spi0_handler()                     { _call_isr(HDL_NVIC_IRQ35_SPI0, __ic->interrupts, 0); } /* IRQ35 */
void spi1_handler()                     { _call_isr(HDL_NVIC_IRQ36_SPI1, __ic->interrupts, 0); } /* IRQ36 */
void usart0_handler()                   { _call_isr(HDL_NVIC_IRQ37_USART0, __ic->interrupts, 0); } /* IRQ37 */
void usart1_handler()                   { _call_isr(HDL_NVIC_IRQ38_USART1, __ic->interrupts, 0); } /* IRQ38 */
void USART2_IRQHandler()                { _call_isr(HDL_NVIC_IRQ39_USART2, __ic->interrupts, 0); } /* IRQ39 */
void EXTI10_15_IRQHandler()             { _call_isr(HDL_NVIC_IRQ40_EXTI10_15, __ic->interrupts, EXTI_PD & EXTI_LINES_10_15); EXTI_PD |= EXTI_LINES_10_15; } /* IRQ40 */
void RTC_Alarm_IRQHandler()             { _call_isr(HDL_NVIC_IRQ41_RTC_Alarm, __ic->interrupts, 0); } /* IRQ41 */
void USBD_WKUP_IRQHandler()             { _call_isr(HDL_NVIC_IRQ42_USBD_WKUP, __ic->interrupts, 0); } /* IRQ42 */
void TIMER7_BRK_TIMER11_IRQHandler()    { _call_isr(HDL_NVIC_IRQ43_TIMER7_BRK_TIMER11, __ic->interrupts, 0); } /* IRQ43 */
void TIMER7_UP_TIMER12_IRQHandler()     { _call_isr(HDL_NVIC_IRQ44_TIMER7_UP_TIMER12, __ic->interrupts, 0); } /* IRQ44 */
void TIMER7_TRG_CMT_TIMER13_IRQHandler(){ _call_isr(HDL_NVIC_IRQ45_TIMER7_TRG_CMT_TIMER13, __ic->interrupts, 0); } /* IRQ45 */
void TIMER7_Channel_IRQHandler()        { _call_isr(HDL_NVIC_IRQ46_TIMER7_Channel, __ic->interrupts, 0); }  /* IRQ46 */
void ADC2_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ47_ADC2, __ic->interrupts, 0); } /* IRQ47 */
void EXMC_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ48_EXMC, __ic->interrupts, 0); } /* IRQ48 */
void SDIO_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ49_SDIO, __ic->interrupts, 0); } /* IRQ49 */
void TIMER4_IRQHandler()                { _call_isr(HDL_NVIC_IRQ50_TIMER4, __ic->interrupts, 0); } /* IRQ50 */
void SPI2_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ51_SPI2, __ic->interrupts, 0); } /* IRQ51 */
void UART3_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ52_UART3, __ic->interrupts, 0); } /* IRQ52 */
void UART4_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ53_UART4, __ic->interrupts, 0); } /* IRQ53 */
void timer5_handler()                   { _call_isr(HDL_NVIC_IRQ54_TIMER5, __ic->interrupts, 0); } /* IRQ54 */
void TIMER6_IRQHandler()                { _call_isr(HDL_NVIC_IRQ55_TIMER6, __ic->interrupts, 0); } /* IRQ55 */
void DMA1_Channel0_IRQHandler()         { _call_isr(HDL_NVIC_IRQ56_DMA1_Channel0, __ic->interrupts, 0); } /* IRQ56 */
void DMA1_Channel1_IRQHandler()         { _call_isr(HDL_NVIC_IRQ57_DMA1_Channel1, __ic->interrupts, 0); } /* IRQ57 */
void DMA1_Channel2_IRQHandler()         { _call_isr(HDL_NVIC_IRQ58_DMA1_Channel2, __ic->interrupts, 0); } /* IRQ58 */
void DMA1_Channel3_4_IRQHandler()       { _call_isr(HDL_NVIC_IRQ59_DMA1_Channel3_Channel4, __ic->interrupts, 0); } /* IRQ59 */
#endif /* GD32F10X_XD */
#ifdef GD32F10X_CL
void CAN0_TX_IRQHandler()               { _call_isr(HDL_NVIC_IRQ19_CAN0_TX, __ic->interrupts, 0); } /* IRQ19 */
void CAN0_RX0_IRQHandler()              { _call_isr(HDL_NVIC_IRQ20_CAN0_RX0, __ic->interrupts, 0); } /* IRQ20 */
void CAN0_RX1_IRQHandler()              { _call_isr(HDL_NVIC_IRQ21_CAN0_RX1, __ic->interrupts, 0); } /* IRQ21 */
void CAN0_EWMC_IRQHandler()             { _call_isr(HDL_NVIC_IRQ22_CAN0_EWMC, __ic->interrupts, 0); } /* IRQ22 */
void EXTI5_9_IRQHandler()               { _call_isr(HDL_NVIC_IRQ23_EXTI5_9, __ic->interrupts, EXTI_PD & EXTI_LINES_5_9); } /* IRQ23 */
void TIMER0_BRK_IRQHandler()            { _call_isr(HDL_NVIC_IRQ24_TIMER0_BRK, __ic->interrupts, 0); } /* IRQ24 */
void TIMER0_UP_IRQHandler()             { _call_isr(HDL_NVIC_IRQ25_TIMER0_UP, __ic->interrupts, 0); } /* IRQ25 */
void TIMER0_TRG_CMT_IRQHandler()        { _call_isr(HDL_NVIC_IRQ26_TIMER0_TRG_CMT, __ic->interrupts, 0); } /* IRQ26 */
void timer0_channel_handler()           { _call_isr(HDL_NVIC_IRQ27_TIMER0_Channel, __ic->interrupts, 0); } /* IRQ27 */
void TIMER1_IRQHandler()                { _call_isr(HDL_NVIC_IRQ28_TIMER1, __ic->interrupts, 0); } /* IRQ28 */
void timer2_handler()                   { _call_isr(HDL_NVIC_IRQ29_TIMER2, __ic->interrupts, 0); } /* IRQ29 */
void TIMER3_IRQHandler()                { _call_isr(HDL_NVIC_IRQ30_TIMER3, __ic->interrupts, 0); } /* IRQ30 */
void i2c0_ev_handler()                  { _call_isr(HDL_NVIC_IRQ31_I2C0_EV, __ic->interrupts, 0); } /* IRQ31 */
void i2c0_er_handler()                  { _call_isr(HDL_NVIC_IRQ32_I2C0_ER, __ic->interrupts, 0); } /* IRQ32 */
void i2c1_ev_handler()                  { _call_isr(HDL_NVIC_IRQ33_I2C1_EV, __ic->interrupts, 0); } /* IRQ33 */
void i2c1_er_handler()                  { _call_isr(HDL_NVIC_IRQ34_I2C1_ER, __ic->interrupts, 0); } /* IRQ34 */
void spi0_handler()                     { _call_isr(HDL_NVIC_IRQ35_SPI0, __ic->interrupts, 0); } /* IRQ35 */
void spi1_handler()                     { _call_isr(HDL_NVIC_IRQ36_SPI1, __ic->interrupts, 0); } /* IRQ36 */
void usart0_handler()                   { _call_isr(HDL_NVIC_IRQ37_USART0, __ic->interrupts, 0); } /* IRQ37 */
void usart1_handler()                   { _call_isr(HDL_NVIC_IRQ38_USART1, __ic->interrupts, 0); } /* IRQ38 */
void USART2_IRQHandler()                { _call_isr(HDL_NVIC_IRQ39_USART2, __ic->interrupts, 0); } /* IRQ39 */
void EXTI10_15_IRQHandler()             { _call_isr(HDL_NVIC_IRQ40_EXTI10_15, __ic->interrupts, EXTI_PD & EXTI_LINES_10_15); EXTI_PD |= EXTI_LINES_10_15; } /* IRQ40 */
void RTC_Alarm_IRQHandler()             { _call_isr(HDL_NVIC_IRQ41_RTC_ALARM, __ic->interrupts, 0); } /* IRQ41 */
void USBFS_WKUP_IRQHandler()            { _call_isr(HDL_NVIC_IRQ42_USBFS_WKUP, __ic->interrupts, 0); } /* IRQ42 */
void TIMER7_BRK_IRQHandler()            { _call_isr(HDL_NVIC_IRQ43_TIMER7_BRK, __ic->interrupts, 0); } /* IRQ43 */
void TIMER7_UP_IRQHandler()             { _call_isr(HDL_NVIC_IRQ44_TIMER7_UP, __ic->interrupts, 0); } /* IRQ44 */
void TIMER7_TRG_CMT_IRQHandler()        { _call_isr(HDL_NVIC_IRQ45_TIMER7_TRG_CMT, __ic->interrupts, 0); } /* IRQ45 */
void TIMER7_Channel_IRQHandler()        { _call_isr(HDL_NVIC_IRQ46_TIMER7_Channel, __ic->interrupts, 0); } /* IRQ46 */ 
void EXMC_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ48_EXMC, __ic->interrupts, 0); } /* IRQ48 */
void TIMER4_IRQHandler()                { _call_isr(HDL_NVIC_IRQ50_TIMER4, __ic->interrupts, 0); } /* IRQ50 */
void SPI2_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ51_SPI2, __ic->interrupts, 0); } /* IRQ51 */
void UART3_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ52_UART3, __ic->interrupts, 0); } /* IRQ52 */
void UART4_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ53_UART4, __ic->interrupts, 0); } /* IRQ53 */
void timer5_handler()                   { _call_isr(HDL_NVIC_IRQ54_TIMER5, __ic->interrupts, 0); } /* IRQ54 */
void TIMER6_IRQHandler()                { _call_isr(HDL_NVIC_IRQ55_TIMER6, __ic->interrupts, 0); } /* IRQ55 */
void DMA1_Channel0_IRQHandler()         { _call_isr(HDL_NVIC_IRQ56_DMA1_Channel0, __ic->interrupts, 0); } /* IRQ56 */
void DMA1_Channel1_IRQHandler()         { _call_isr(HDL_NVIC_IRQ57_DMA1_Channel1, __ic->interrupts, 0); } /* IRQ57 */
void DMA1_Channel2_IRQHandler()         { _call_isr(HDL_NVIC_IRQ58_DMA1_Channel2, __ic->interrupts, 0); } /* IRQ58 */
void DMA1_Channel3_IRQHandler()         { _call_isr(HDL_NVIC_IRQ59_DMA1_Channel3, __ic->interrupts, 0); } /* IRQ59 */
void DMA1_Channel4_IRQHandler()         { _call_isr(HDL_NVIC_IRQ60_DMA1_Channel4, __ic->interrupts, 0); } /* IRQ60 */
void ENET_IRQHandler()                  { _call_isr(HDL_NVIC_IRQ61_ENET, __ic->interrupts, 0); } /* IRQ61 */
void ENET_WKUP_IRQHandler()             { _call_isr(HDL_NVIC_IRQ62_ENET_WKUP, __ic->interrupts, 0); } /* IRQ62 */
void CAN1_TX_IRQHandler()               { _call_isr(HDL_NVIC_IRQ63_CAN1_TX, __ic->interrupts, 0); } /* IRQ63 */
void CAN1_RX0_IRQHandler()              { _call_isr(HDL_NVIC_IRQ64_CAN1_RX0, __ic->interrupts, 0); } /* IRQ64 */
void CAN1_RX1_IRQHandler()              { _call_isr(HDL_NVIC_IRQ65_CAN1_RX1, __ic->interrupts, 0); } /* IRQ65 */
void CAN1_EWMC_IRQHandler()             { _call_isr(HDL_NVIC_IRQ66_CAN1_EWMC, __ic->interrupts, 0); } /* IRQ66 */
void USBFS_IRQHandler()                 { _call_isr(HDL_NVIC_IRQ67_USBFS, __ic->interrupts, 0); } /* IRQ67 */
#endif /* GD32F10X_CL */

void * g_pfnVectors[0x60] __attribute__ ((section (".isr_vector"), used)) = {
  &_estack,
  &Reset_Handler,
  &NMI_Handler,
  &HardFault_Handler,
  &MemManage_Handler,
  &BusFault_Handler,
  &UsageFault_Handler,
  (void *)NULL,
  (void *)NULL,
  (void *)NULL,
  (void *)NULL,
  &SVC_Handler,
  &DebugMon_Handler,
  (void *)NULL,
  &PendSV_Handler,
  &SysTick_Handler,

