Sambulov/COS/MCU/ARM/Gigadevice/GD32F103VG/Port/port_core.c
  &wwdgt_handler,                    /* IRQ0 */
  &lvd_handler,                      /* IRQ1 */
  &TAMPER_IRQHandler,                   /* IRQ2 */
  &rtc_handler,                      /* IRQ3 */
  &fmc_handler,                      /* IRQ4 */
  &rcu_handler,                      /* IRQ5 */
  &EXTI0_IRQHandler,                    /* IRQ6 */
  &EXTI1_IRQHandler,                    /* IRQ7 */
  &EXTI2_IRQHandler,                    /* IRQ8 */
  &EXTI3_IRQHandler,                    /* IRQ9 */
  &EXTI4_IRQHandler,                    /* IRQ10 */
  &DMA0_Channel0_IRQHandler,            /* IRQ11 */
  &DMA0_Channel1_IRQHandler,            /* IRQ12 */
  &DMA0_Channel2_IRQHandler,            /* IRQ13 */
  &DMA0_Channel3_IRQHandler,            /* IRQ14 */
  &DMA0_Channel4_IRQHandler,            /* IRQ15 */
  &DMA0_Channel5_IRQHandler,            /* IRQ16 */
  &DMA0_Channel6_IRQHandler,            /* IRQ17 */
  &ADC0_1_IRQHandler,                   /* IRQ18 */
#ifdef GD32F10X_MD
  &USBD_HP_CAN0_TX_IRQHandler,          /* IRQ19 */
  &USBD_LP_CAN0_RX0_IRQHandler,         /* IRQ20 */
  &CAN0_RX1_IRQHandler,                 /* IRQ21 */
  &CAN0_EWMC_IRQHandler,                /* IRQ22 */
  &EXTI5_9_IRQHandler,                  /* IRQ23 */
  &TIMER0_BRK_IRQHandler,               /* IRQ24 */
  &TIMER0_UP_IRQHandler,                /* IRQ25 */
  &TIMER0_TRG_CMT_IRQHandler,           /* IRQ26 */
  &timer0_channel_handler,           /* IRQ27 */
  &TIMER1_IRQHandler,                   /* IRQ28 */
  &timer2_handler,                   /* IRQ29 */
  &TIMER3_IRQHandler,                   /* IRQ30 */
  &i2c0_ev_handler,                  /* IRQ31 */
  &i2c0_er_handler,                  /* IRQ32 */
  &i2c1_ev_handler,                  /* IRQ33 */
  &i2c1_er_handler,                  /* IRQ34 */
  &spi0_handler,                     /* IRQ35 */
  &spi1_handler,                     /* IRQ36 */
  &usart0_handler,                   /* IRQ37 */
  &usart1_handler,                   /* IRQ38 */
  &USART2_IRQHandler,                   /* IRQ39 */
  &EXTI10_15_IRQHandler,                /* IRQ40 */
  &RTC_Alarm_IRQHandler,                /* IRQ41 */
  &USBD_WKUP_IRQHandler,                /* IRQ42 */
  &irq_n_handler,                       /* IRQ43 */
  &irq_n_handler,                       /* IRQ44 */
  &irq_n_handler,                       /* IRQ45 */
  &irq_n_handler,                       /* IRQ46 */
  &irq_n_handler,                       /* IRQ47 */
  &EXMC_IRQHandler,                     /* IRQ48 */
  &irq_n_handler,                       /* IRQ49 */
  &irq_n_handler,                       /* IRQ50 */
  &irq_n_handler,                       /* IRQ51 */
  &irq_n_handler,                       /* IRQ52 */
  &irq_n_handler,                       /* IRQ53 */
  &irq_n_handler,                       /* IRQ54 */
  &irq_n_handler,                       /* IRQ55 */
  &irq_n_handler,                       /* IRQ56 */
  &irq_n_handler,                       /* IRQ57 */
  &irq_n_handler,                       /* IRQ58 */
  &irq_n_handler,                       /* IRQ59 */
  &irq_n_handler,                       /* IRQ60 */
  &irq_n_handler,                       /* IRQ61 */
  &irq_n_handler,                       /* IRQ62 */
  &irq_n_handler,                       /* IRQ63 */
  &irq_n_handler,                       /* IRQ64 */
  &irq_n_handler,                       /* IRQ65 */
  &irq_n_handler,                       /* IRQ66 */
  &irq_n_handler,                       /* IRQ67 */
#endif /* GD32F10X_MD */
#ifdef GD32F10X_HD
  &USBD_HP_CAN0_TX_IRQHandler,          /* IRQ19 */
  &USBD_LP_CAN0_RX0_IRQHandler,         /* IRQ20 */
  &CAN0_RX1_IRQHandler,                 /* IRQ21 */
  &CAN0_EWMC_IRQHandler,                /* IRQ22 */
  &EXTI5_9_IRQHandler,                  /* IRQ23 */
  &TIMER0_BRK_IRQHandler,               /* IRQ24 */
  &TIMER0_UP_IRQHandler,                /* IRQ25 */
  &TIMER0_TRG_CMT_IRQHandler,           /* IRQ26 */
  &timer0_channel_handler,           /* IRQ27 */
  &TIMER1_IRQHandler,                   /* IRQ28 */
  &timer2_handler,                   /* IRQ29 */
  &TIMER3_IRQHandler,                   /* IRQ30 */
  &i2c0_ev_handler,                  /* IRQ31 */
  &i2c0_er_handler,                  /* IRQ32 */
  &i2c1_ev_handler,                  /* IRQ33 */
  &i2c1_er_handler,                  /* IRQ34 */
  &spi0_handler,                     /* IRQ35 */
  &spi1_handler,                     /* IRQ36 */
  &usart0_handler,                   /* IRQ37 */
  &usart1_handler,                   /* IRQ38 */
  &USART2_IRQHandler,                   /* IRQ39 */
  &EXTI10_15_IRQHandler,                /* IRQ40 */
  &RTC_Alarm_IRQHandler,                /* IRQ41 */
  &USBD_WKUP_IRQHandler,                /* IRQ42 */
  &TIMER7_BRK_IRQHandler,               /* IRQ43 */
  &TIMER7_UP_IRQHandler,                /* IRQ44 */
  &TIMER7_TRG_CMT_IRQHandler,           /* IRQ45 */
  &TIMER7_Channel_IRQHandler,           /* IRQ46 */
  &ADC2_IRQHandler,                     /* IRQ47 */
  &EXMC_IRQHandler,                     /* IRQ48 */
  &SDIO_IRQHandler,                     /* IRQ49 */
  &TIMER4_IRQHandler,                   /* IRQ50 */
  &SPI2_IRQHandler,                     /* IRQ51 */
  &UART3_IRQHandler,                    /* IRQ52 */
  &UART4_IRQHandler,                    /* IRQ53 */
  &timer5_handler,                   /* IRQ54 */
  &TIMER6_IRQHandler,                   /* IRQ55 */
  &DMA1_Channel0_IRQHandler,            /* IRQ56 */
  &DMA1_Channel1_IRQHandler,            /* IRQ57 */
  &DMA1_Channel2_IRQHandler,            /* IRQ58 */
  &DMA1_Channel3_4_IRQHandler,          /* IRQ59 */
  &irq_n_handler,                       /* IRQ60 */
  &irq_n_handler,                       /* IRQ61 */
  &irq_n_handler,                       /* IRQ62 */
  &irq_n_handler,                       /* IRQ63 */
  &irq_n_handler,                       /* IRQ64 */
  &irq_n_handler,                       /* IRQ65 */
  &irq_n_handler,                       /* IRQ66 */
  &irq_n_handler,                       /* IRQ67 */
#endif /* GD32F10X_HD */
#ifdef GD32F10X_XD
  &USBD_HP_CAN0_TX_IRQHandler,          /* IRQ19 */
  &USBD_LP_CAN0_RX0_IRQHandler,         /* IRQ20 */
  &CAN0_RX1_IRQHandler,                 /* IRQ21 */
  &CAN0_EWMC_IRQHandler,                /* IRQ22 */
  &EXTI5_9_IRQHandler,                  /* IRQ23 */
  &TIMER0_BRK_TIMER8_IRQHandler,        /* IRQ24 */
  &TIMER0_UP_TIMER9_IRQHandler,         /* IRQ25 */
  &TIMER0_TRG_CMT_TIMER10_IRQHandler,   /* IRQ26 */
  &timer0_channel_handler,           /* IRQ27 */
  &TIMER1_IRQHandler,                   /* IRQ28 */
  &timer2_handler,                   /* IRQ29 */
  &TIMER3_IRQHandler,                   /* IRQ30 */
  &i2c0_ev_handler,                  /* IRQ31 */
  &i2c0_er_handler,                  /* IRQ32 */
  &i2c1_ev_handler,                  /* IRQ33 */
  &i2c1_er_handler,                  /* IRQ34 */
  &spi0_handler,                     /* IRQ35 */
  &spi1_handler,                     /* IRQ36 */
  &usart0_handler,                   /* IRQ37 */
  &usart1_handler,                   /* IRQ38 */
  &USART2_IRQHandler,                   /* IRQ39 */
  &EXTI10_15_IRQHandler,                /* IRQ40 */
  &RTC_Alarm_IRQHandler,                /* IRQ41 */
  &USBD_WKUP_IRQHandler,                /* IRQ42 */
  &TIMER7_BRK_TIMER11_IRQHandler,       /* IRQ43 */
  &TIMER7_UP_TIMER12_IRQHandler,        /* IRQ44 */
  &TIMER7_TRG_CMT_TIMER13_IRQHandler,   /* IRQ45 */
  &TIMER7_Channel_IRQHandler,           /* IRQ46 */
  &ADC2_IRQHandler,                     /* IRQ47 */
  &EXMC_IRQHandler,                     /* IRQ48 */
  &SDIO_IRQHandler,                     /* IRQ49 */
  &TIMER4_IRQHandler,                   /* IRQ50 */
  &SPI2_IRQHandler,                     /* IRQ51 */
  &UART3_IRQHandler,                    /* IRQ52 */
  &UART4_IRQHandler,                    /* IRQ53 */
  &timer5_handler,                   /* IRQ54 */
  &TIMER6_IRQHandler,                   /* IRQ55 */
  &DMA1_Channel0_IRQHandler,            /* IRQ56 */
  &DMA1_Channel1_IRQHandler,            /* IRQ57 */
  &DMA1_Channel2_IRQHandler,            /* IRQ58 */
  &DMA1_Channel3_4_IRQHandler,          /* IRQ59 */
  &irq_n_handler,                       /* IRQ60 */
  &irq_n_handler,                       /* IRQ61 */
  &irq_n_handler,                       /* IRQ62 */
  &irq_n_handler,                       /* IRQ63 */
  &irq_n_handler,                       /* IRQ64 */
  &irq_n_handler,                       /* IRQ65 */
  &irq_n_handler,                       /* IRQ66 */
  &irq_n_handler,                       /* IRQ67 */
#endif /* GD32F10X_XD */
#ifdef GD32F10X_CL
  &CAN0_TX_IRQHandler,                  /* IRQ19 */
  &CAN0_RX0_IRQHandler,                 /* IRQ20 */
  &CAN0_RX1_IRQHandler,                 /* IRQ21 */
  &CAN0_EWMC_IRQHandler,                /* IRQ22 */
  &EXTI5_9_IRQHandler,                  /* IRQ23 */
  &TIMER0_BRK_IRQHandler,               /* IRQ24 */
  &TIMER0_UP_IRQHandler,                /* IRQ25 */
  &TIMER0_TRG_CMT_IRQHandler,           /* IRQ26 */
  &timer0_channel_handler,           /* IRQ27 */
  &TIMER1_IRQHandler,                   /* IRQ28 */
  &timer2_handler,                   /* IRQ29 */
  &TIMER3_IRQHandler,                   /* IRQ30 */
  &i2c0_ev_handler,                  /* IRQ31 */
  &i2c0_er_handler,                  /* IRQ32 */
  &i2c1_ev_handler,                  /* IRQ33 */
  &i2c1_er_handler,                  /* IRQ34 */
  &spi0_handler,                     /* IRQ35 */
  &spi1_handler,                     /* IRQ36 */
  &usart0_handler,                   /* IRQ37 */
  &usart1_handler,                   /* IRQ38 */
  &USART2_IRQHandler,                   /* IRQ39 */
  &EXTI10_15_IRQHandler,                /* IRQ40 */
  &RTC_Alarm_IRQHandler,                /* IRQ41 */
  &USBFS_WKUP_IRQHandler,               /* IRQ42 */
  &TIMER7_BRK_IRQHandler,               /* IRQ43 */
  &TIMER7_UP_IRQHandler,                /* IRQ44 */
  &TIMER7_TRG_CMT_IRQHandler,           /* IRQ45 */
  &TIMER7_Channel_IRQHandler,           /* IRQ46 */ 
  &irq_n_handler,                       /* IRQ47 */
  &EXMC_IRQHandler,                     /* IRQ48 */
  &irq_n_handler,                       /* IRQ49 */
  &TIMER4_IRQHandler,                   /* IRQ50 */
  &SPI2_IRQHandler,                     /* IRQ51 */
  &UART3_IRQHandler,                    /* IRQ52 */
  &UART4_IRQHandler,                    /* IRQ53 */
  &timer5_handler,                   /* IRQ54 */
  &TIMER6_IRQHandler,                   /* IRQ55 */
  &DMA1_Channel0_IRQHandler,            /* IRQ56 */
  &DMA1_Channel1_IRQHandler,            /* IRQ57 */
  &DMA1_Channel2_IRQHandler,            /* IRQ58 */
  &DMA1_Channel3_IRQHandler,            /* IRQ59 */
  &DMA1_Channel4_IRQHandler,            /* IRQ60 */
  &ENET_IRQHandler,                     /* IRQ61 */
  &ENET_WKUP_IRQHandler,                /* IRQ62 */
  &CAN1_TX_IRQHandler,                  /* IRQ63 */
  &CAN1_RX0_IRQHandler,                 /* IRQ64 */
  &CAN1_RX1_IRQHandler,                 /* IRQ65 */
  &CAN1_EWMC_IRQHandler,                /* IRQ66 */
  &USBFS_IRQHandler,                    /* IRQ67 */
#endif /* GD32F10X_CL */
  &irq_n_handler,                       /* IRQ68 */
  &irq_n_handler,                       /* IRQ69 */
  &irq_n_handler,                       /* IRQ70 */
  &irq_n_handler,                       /* IRQ71 */
  &irq_n_handler,                       /* IRQ72 */
  &irq_n_handler,                       /* IRQ73 */
  &irq_n_handler,                       /* IRQ74 */
  &irq_n_handler,                       /* IRQ75 */
  &irq_n_handler,                       /* IRQ76 */
  &irq_n_handler,                       /* IRQ77 */
  &irq_n_handler,                       /* IRQ78 */
  &irq_n_handler,                       /* IRQ79 */
};

// __attribute__((naked)) void switch_to_psp(void) {
//   // change PSP
//   asm("LDR R0, =_psp_stack");
//   asm("MSR PSP, R0");
//   // set SPSEL bit
//   asm("MRS R1, CONTROL");
//   asm("ORR R1, R1, #2");
//   asm("MSR CONTROL, R1");
//   // return
//   asm("BX LR");
// }

// __attribute__ ((naked)) void switch_to_unprivileged(void) {
//   // set nPRIV bit
//   asm("MRS R0, CONTROL");
//   asm("ORR R0, R0, #1");
//   asm("MSR CONTROL, r0");
//   // return
//   asm("BX LR");
// }

__attribute__((naked, noreturn)) void Reset_Handler() {
	//asm ("ldr sp, =_estack");
	void **pSource, **pDest;
	for (pSource = &_sidata, pDest = &_sdata; pDest != &_edata; pSource++, pDest++)
	  *pDest = *pSource;

  for (pDest = &_sbss; pDest != &_ebss; pDest++)
    *pDest = 0;
  //TODO: turn off JTAG;
  __libc_init_array();
  //SystemInit();
  main();
  for (;;) ;
}

/* TODO: check sv call, exapmple call: asm("SVC #6"); */
__attribute__ ((naked)) void SVC_Handler(void) {
  //asm("TST LR, 4"); // check LR to know which stack is used
  //asm("ITE EQ"); // 2 next instructions are conditional
  //asm("MRSEQ R0, MSP"); // save MSP if bit 2 is 0
  //asm("MRSNE R0, PSP"); // save PSP if bit 2 is 1

  asm("MRS R0, MSP"); // save MSP stack pointer value

  asm("B svc_handler_main"); // pass R0 as the argument
}

/* TODO: test with __attribute__ ((naked)) */
static void svc_handler_main(uint32_t *sp) {
  /* get the address of the instruction saved in PC */
  uint8_t *instruction = (uint8_t *)(sp[6]);
  /* go back 2 bytes (16-bit opcode) */
  instruction -= 2;
  /* get the opcode, in little endian */
  _call_isr(SVCall_IRQn, __ic->interrupts, (uint8_t)*instruction);
}

void irq_n_handler() {
  uint32_t prio = -1;
  IRQn_Type irq = 0;
  for(uint32_t i = 0; i < sizeof(NVIC->IABR)/sizeof(NVIC->IABR[0]); i++) {
    uint32_t iabr = NVIC->IABR[i];
    while(iabr) {
      uint8_t bit = 31 - __CLZ(iabr);
      IRQn_Type cur_irq = (32 * i) + bit;
      uint32_t cur_prio = NVIC_GetPriority(cur_irq);
      if(cur_prio < prio) {
        irq = cur_irq;
        prio = cur_prio;
      }
      iabr &= ~(1 << bit);
    }
  }
  _call_isr(irq, __ic->interrupts, 0);
}

