Sambulov/COS/MCU/ARM/Gigadevice/GD32F103VG/Port/port_core.c
hdl_module_state_t hdl_core(void *desc, uint8_t enable) {
  /* TODO: */
  if(enable) {
    hdl_core_t *core = (hdl_core_t *)desc;
    FMC_WS = (FMC_WS & (~FMC_WS_WSCNT)) | core->flash_latency;
    rcu_periph_clock_enable(RCU_AF);
    return HDL_MODULE_INIT_OK;
  }
  rcu_periph_clock_disable(RCU_AF);
  FMC_WS = (FMC_WS & (~FMC_WS_WSCNT)) | WS_WSCNT_0;
  return HDL_MODULE_DEINIT_OK;
}

hdl_module_state_t hdl_interrupt_controller(void *desc, uint8_t enable) {
  if(enable) {
    hdl_nvic_t *nvic = (hdl_nvic_t *)desc;
    /* TODO: NVIC_SetPriorityGrouping  */
    nvic_vector_table_set(NVIC_VECTTAB_FLASH, 0);
    //SYSCFG_CPU_IRQ_LAT = nvic->irq_latency;
    __ic = (hdl_nvic_t *)desc;
    /* TODO: fing wokaround to save context for interrupt vector */
    return HDL_MODULE_INIT_OK;
  }
  else {
    //TODO: disable envic
  }
  return HDL_MODULE_DEINIT_OK;
}

uint8_t hdl_interrupt_request(hdl_nvic_t *ic, hdl_nvic_irq_n_t irq, hdl_delegate_t *delegate) {
  if((hdl_state(&ic->module) != HDL_MODULE_INIT_OK) || (ic->interrupts == NULL) || (delegate == NULL))
    return HDL_FALSE;
  hdl_nvic_interrupt_private_t **isr = (hdl_nvic_interrupt_private_t **)ic->interrupts;
  while ((isr != NULL) && (*isr != NULL) && (*isr)->irq_type != irq) isr++;
  if((isr == NULL) || (*isr == NULL)) return HDL_FALSE;
  hdl_event_subscribe(&(*isr)->event, delegate);
  uint8_t prio = (((*isr)->priority_group << (8U - ic->prio_bits)) | 
                  ((*isr)->priority & (0xFF >> ic->prio_bits)) & 
                  0xFFUL);
  volatile uint8_t *ipr = ((*isr)->irq_type < 0)? &(SCB->SHP[((*isr)->irq_type & 0xFUL) - 4UL]):
                                                    &(NVIC->IP[(*isr)->irq_type]);
  /* set priority for interrupt */
  *ipr = prio;
  /* interrupt enable */
  if((*isr)->irq_type < 0) {
    switch ((*isr)->irq_type) {
      case SysTick_IRQn:
        SysTick->CTRL |= SysTick_CTRL_TICKINT_Msk;                  /* Enable SysTick IRQ */
        break;
      case PendSV_IRQn:
        // TODO: enable if possible, ;
        break;
      case SVCall_IRQn:
        // TODO: enable if possible, ;
        break;
      case HardFault_IRQn:
        // TODO: enable if possible, ;
        break;
      case NonMaskableInt_IRQn:
        // TODO: enable if possible, ;
        break;
      default:
        return HDL_FALSE;
    }
  }
  else {
    NVIC_EnableIRQ((*isr)->irq_type);
  }
  return HDL_TRUE;
}

void hdl_interrupt_sw_trigger(hdl_nvic_irq_n_t interrupt) {
  NVIC_SetPendingIRQ(interrupt);
}
